/*2.企业发放的奖金根据利润提成
    利润（I）低于或等于10万元时，奖金可提10%；
    利润高于10万元，低于20万元时，低于10万元的部分按10%10%提成，高于10万元的部分，可提成7.5%；
    20万到40万之间，高于20万的部分，可提成5%；
    40万到60万之间，高于40万的部分，可提成3%；
    60万到100万之间，高于60万的部分，可提成1.5%
    高于100万的部分，可提成1%。
    输入当月利润（I），求应发放奖金总数？
*/

#include <stdio.h>
int main()
{
    //建立变量
	int I = 0, c = 0;
    //获取利润
	printf("Please enter profit:");
	scanf_s("%d", &I);

    //进行条件筛选并输出结果
	if (I <= 100000) {
		c = I * 0.1;
	}
	else if (I <= 200000) {
		c = (I - 100000) * 0.075 + 100000 * 0.1;
		printf("The bouns is %d\n", c);
	}
	else if (I <= 400000) {
		c = (I - 200000) * 0.05 + 200000 * 0.075 + 100000 * 0.1;
		printf("The bouns is %d\n", c);
	}
	else if (I <= 600000) {
		c = (I - 400000) * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1;
		printf("The bouns is %d\n", c);
	}
	else if (I <= 1000000) {
		c = (I - 600000) * 0.015 + 200000 * 0.03 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1;
		printf("The bouns is %d\n", c);
	}
	else if (I > 1000000){
		c = (I - 1000000) * 0.001 + 400000 * 0.015 + 200000 * 0.05 + 100000 * 0.075 + 100000 * 0.1;
		printf("The bouns is %d\n", c);
	}
    //提出异常输入
	else {
		printf("Error : Please enter a right profit");
	}
	return 0;
}