//3.一个整数，加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
/*依照题目，可得
x + 100 = n²
x + 100 + 168 = m²
=> (m + n)(m - n) = 168
令m + n = i, m - n = j
=> i * j = 168 
按照C语言逻辑，有2 <= i, j <= 168
*/

#include <stdio.h>
int main()
{
    //创建变量
	int m, n;
	int i, j = 0;
    //按照逻辑遍历
	for (i = 2; i <= 168 / 2; i++) {
        //加入整数条件
		if (168 % i == 0) {
			j = 168 / i;
            //加入方程成立条件
			if (i <= j && (i + j) % 2 == 0 && (i - j) % 2 == 0) {
				m = (i + j) / 2;
				n = (i - j) / 2;
                //输出结果
				printf("x = %d\n", m * m - 268);
			}
		}
	}
	return 0;
}